app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings

		sort_column = params[:sort]
		sort_ratings = params[:ratings]
		#debugger
		session[:sort] = sort_column	if sort_column
		session[:ratings] = sort_ratings if sort_ratings

		@movies =  Movie.where(:rating => session[:ratings].keys) if session[:ratings].present?

		if @movies
		 session[:sort] ? @movies = @movies.order(session[:sort]) : @movies = @movies.all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY title?utf8=✓
SELECT "movies".* FROM "movies" ORDER BY release_date desc